# print('Привет')
# print('всем')
# print('\nЯ рад видеть вас снова')
# print('\t\t\tКак ваши\nдела')
print('за\'втра, ",будет" дождь')
# print('завтра будет \'великолепный\' день и \"чудесная\" погода')
# print()  # вывод пустой строки которая отделит два принта
# \’ – выводит апостроф
# \” выводит двойную кавычку
# \\ выводит \
# \а звук динамика
# \n новая строка. Перемещает курсор в начало следующей строки.
# \t табуляция перемещает курсор вправо на один отступ
# \ растягивает одно выражение на несколько строк кода, символ ставится на месте пробела
# Обратный слеш выводится так
# Print(“\t\t\t \\ \\ \\ \\ \\ \\ \\”) – двойной слеш через пробел выводит слеш \
#
#  swapcase() – возвращает новую строку в которой регистр всех символов обращен : верхний становиться нижним и наоборот
# topology = [['sw1', 'Gi0/1', 'r1', 'Gi0/2'],
#             ['sw1', 'Gi0/2', 'r2', 'Gi0/1'],
#             ['sw1', 'Gi0/3', 'r3', 'Gi0/0'],
#             ['sw1', 'Gi0/5', 'sw4', 'Gi0/2']]
# for connection in topology:
#     l_device, l_port, r_device, r_port = connection
#     print(f'{l_device:10} {l_port:7} {r_device:10} {r_port:7}')

# def mult():
#     for a in [[1, 2, 3], [4, 5, 6], [7, 8, 9]]:
#         if a != 0:
#             print('')
#         for b in range(1, 10):
#             print('%s*%s=%s\t\t\t' % (a[0], b, a[0] * b),
#                       '%s*%s=%s\t\t\t' % (a[1], b, a[0] * b),
#                       '%s*%s=%s\t\t\t' % (a[2], b, a[0] * b), )
# if __name__ == '__main__':
#         mult()
