# Практическая работа
# Напишите программу, которая запрашивает ввод двух значений. Если хотя бы одно из них не является числом, то должна
# выполняться конкатенация, то есть соединение, строк. В остальных случаях введенные числа суммируются.

# try:
#     a = input('num1: ')
#     b = input('num2: ')
#     print(int(a) + int(b))
# except ValueError:
#     print(a + b)

#  описать функцию для деления двух чисел, ошибка Zerrodevision error

# def fun(a, b):
#     try:
#         return a / b
#     except ZeroDivisionError:
#         return 'Деление на ноль запрещено'
#
# print(fun(10, 0))

# ДЗ
# Залить этот файл на git
# Посмотреть базы данных

